app/Controllers/Admin/Admin.php

SELECT *
FROM `produk`
 LIMIT 10, 5
SELECT COUNT(*) AS `numrows`
FROM `produk`
---
    public function index()
    {

        $produk = new ProdukModel();;
        $data['produk'] = $produk->paginate($this->perpage, 'bootstrap');

SELECT *
FROM `produk`
WHERE `id` = '26'
 LIMIT 1
UPDATE `produk` SET `nama` = 'kapo', `slug` = 'kapo', `deskripsi` = 'awsa', `ukuran` = 'XXXL', `berat` = '1', `stok` = '1', `harga` = '1', `gambar` = 'Kopi Luwak.jpg', `promo` = '1', `status` = 'jual', `updated_at` = '2023-06-14 15:38:16'
WHERE `produk`.`id` IN ('26')
---
    public function edit($id)
    {


        // ambil artikel yang akan diedit
        $produk = new ProdukModel();
        $data['produk'] = $produk->where('id', $id)->first();

        // lakukan validasi data artikel
        $validation =  \Config\Services::validation();
        $validation->setRules([
            'id' => 'required',
            'nama' => 'required',

        ]);

        $isDataValid = $validation->withRequest($this->request)->run();
        // jika data vlid, maka simpan ke database
        if ($isDataValid) {
            $upload = $this->request->getFile('gambar');
            $folderID = $this->request->getPost('id');
            $pathfile = '../public/assets/images/produk/' . $folderID;
            $upload->move(WRITEPATH .  $pathfile, $name = $upload->getName(), $overwrite = true);
            $produk->update($id, [
                "nama" => $this->request->getPost('nama'),
                "slug" => url_title($this->request->getVar('nama'), '-', TRUE),
                "deskripsi" => $this->request->getPost('deskripsi'),
                "ukuran" => $this->request->getPost('ukuran'),
                "berat" => $this->request->getPost('berat'),
                "stok" => $this->request->getPost('stok'),
                "harga" => $this->request->getPost('harga'),
                'gambar' => $upload->getName(),
                "promo" => $this->request->getPost('promo'),
                "status" => $this->request->getPost('status'),
            ]);

SELECT *
FROM `categories`
---

        // tampilkan form edit
        $ukuran = new CategoryModel();
        $data['ukuran'] = $ukuran->findAll();