app/Controllers/User/Dashboard.php

    public function index()
    {

        $produk = new ProdukModel();
        $kunci = $this->request->getVar('keyword');
        $ukuran = $this->request->getVar('ukuran');
        if ($kunci !== null) {
            $data['produk'] = $produk->like('nama', $kunci)->where('status', 'jual')->findAll();
        } elseif ($ukuran !== null) {
            $data['produk'] = $produk->where('ukuran', $ukuran)->findAll();
        } else {
            $data['produk'] = $produk->where('status', 'jual')->findAll();
        }
        $ukuran = new CategoryModel();
        $data['ukuran'] = $ukuran->findAll();
---
SELECT *
FROM `produk`
WHERE `status` = 'jual'
SELECT *
FROM `categories`

    public function detail($slug)
    {
        $produk = new ProdukModel();
        $data['produk'] = $produk->where([
            'slug' => $slug,
            'status' => 'jual'
        ])->first();
---
SELECT *
FROM `produk`
WHERE `slug` = 'kopi-susu-sapi'
AND `status` = 'jual'
 LIMIT 1

    public function pembayaran($slug)
    {
        $produk = new ProdukModel();
        $data['produk'] = $produk->where([
            'slug' => $slug,
            'status' => 'jual'
        ])->first();
---
SELECT *
FROM `produk`
WHERE `slug` = 'kopi-susu-sapi'
AND `status` = 'jual'
 LIMIT 1